const axios = require('axios')

const str = `### 「共道圆桌会」第一期：关于业务、产品、客户体验的种种
  #### 2020年12月
  ------------
  十二月了，每一位同学用心付出了一年后，都收获了属于自己的沉淀和成长，同时也有了更多的感受和思考。本月，我们邀请了10位报名的同学，与大叔在会议室，一起喝着咖啡，吃着点心水果，聊聊思考、疑惑和建议。在现场，同学们除了向大叔提出疑问，彼此也交换观点，探讨热烈。于是，原计划1小时的圆桌会，延长到近2小时..... 内容真是干货满满~~
  
  
  **这10位同学分别是：**
  陈旭亮（政法业务部-售前）、胡春建（政法业务部-项目经理）、孟则（产品部-UED）、南树（产品部-UED）、沈大勇（技术部-市场监管）、颂赞（技术部-前端）、王伟伟（技术部-算法）、王樟幸（技术部-企业服务）、徐兴中（技术部-质量保障）、钟威（技术部-政法）
  
  ------------
  
  
  ![](https://gongdao-oc.oss-cn-hangzhou.aliyuncs.com/%E5%9C%86%E6%A1%8C%E4%BC%9A/IMG_20201211_150409.jpg?OSSAccessKeyId=LTAI4G2FEVzvB65HuFJmJo6f&Expires=1639549932&Signature=RwHCg1AxQrsh%2FoBZdEzfA08zBho%3D)
  
  ------------
  #### 来看看现场大家都聊了些啥：
  
   <span style="color: white;background: #1682E6;font-size: 16px;font-weight:bold">第一部分：关于业务思考
  我们永远要平衡“活在当下”和“过得长远”；通过目标设计来科学分配资源，筛选项目要有标准。</span>
  
  **同学：** 我入职的时候就看到一张图，从上游市场到纠纷解决到诉讼到执行到拍卖的一个案件漏斗，我们当前做的业务离实现服务好PPT上的案件漏斗这个业务模式目标距离还有多远。\n
  **徐殿勇：** 距离有多远取决于我们的执行力，我们和别的创业公司有个很大的区别就是业务模式设计我们一直没有变过：做好供给侧，把需求侧业务拉进来，让他们更高效的在一起，然后我们再做其他法律生态的服务。我觉得再有两三年会有点样子。但是到底是几年，和我们的组织能力很有关系，尤其是业务拓展和管理能力。我们永远要平衡“活在当下”和“过得长远”。我们要做的是在目标设计上更清晰，比如法院线主要目标不再是营收，而看结构和质量，比如saas占比要往50%靠。回到目标设计和打法设计上来，企业带着案子进去的法院这种模式是做的最好的案例，而靠硬推产品的很难跑起来，法院一开始觉得新鲜，一年后发现没有案子进来，连续签都很难。<span style="color: #1682E6"><strong>假如有一天我们有300个办案的通道，我们进入到法院就可以非常容易。</strong></span>
  
  **同学：** 随着对盈利的要求越来越高，资源的分配上倾向于会带来更多盈利的项目，但是很多项目又是基础建设性的，性价比不高，甚至亏，该如何去选择。\n
  **徐殿勇：** 通过对部门间的目标要进一步统一梳理。<span style="color: #1682E6"><strong>我们先把标准化产品所必须的资源锁定，然后再盘资源确定能承接多少定制化项目。</strong></span>对于要对接哪些不接哪些需有一个标准，比如来自基层法院的定制化需求（做了以后不能复制给更多法院），那就不做；中院就可以考虑，高院就更好一点。一定需要有一个判断的标准维度。
  
  **同学：** 当前TO-C业务有没有到可以考虑的程度 \n
  **徐殿勇：** 让公道触手可及我们的使命，但是要考虑打法策略，TO-C盈利方式要想清楚，先让自己活下来，数据和能力都积累了，再去做。过早接入容易让自己被动，但是C是一定会做的。gongdao.com以后就要承载这东西。
  
  **同学：**我们现在是不是已经走到TO-B的阶段了，但是主要研发资源在G上，如果重点在B了，资源会不会因为这个有变动? \n
  **徐殿勇：**现在对于我们来说TO-B为重点还早，现在刚刚还开始GB的连通中，<span style="color: #1682E6"><strong>我们一定要把B这条腿先长出来。这两条腿是并行往前走的。</strong></span>
  
  **同学：**企业线主打大B还是小B是怎么规划的，很多大B钱不多，定制要求很多，投入的产品、技术、运营资源会紧张，这样一年也做不了几个。\n
  **徐殿勇：**第一，我的判断下一年还是以大B为主，企业线的资源可以适当加一点。企业产品定制和解决方案目前没有那么刚需，只要有足够的法院通道，对客户就很有吸引力。第二，我们要考虑有什么技术服务可以提供，三年了，今天如果我们了解客户需求足够多，就可以拿出来很多相对标准化的产品。第三，涉及到交付能力，刚开始我们会有一个“火锅底料”--自有+明非。目前已经有几十个，明年还会有几十个，在刚开始打口碑的时候，这个底料是有用的，把头一批客户服务好，同时大概我们有了业务和平台，找律所、调解机构合作是很容易的，他们是想和我们合作的，因为他们也需要业务的突破和转型。<span style="color: #1682E6"><strong>我们和别人的最大的区别是，别人先收钱，我们先为别人带来业务的，只有先给对方带来生意，再考虑如何做好生意，事实上长尾的律师们缺乏业务，所以我们要给他们带来业务和业务通道。</strong></span>接下来一个月只要锻炼好现有能力，明年一季度就可以接得住多个大。
  对于小B可以分开看，比如数字经济产业园引入的大量的商家可以引入，还可以把这个作为gongdoa.com上服务的延伸，便于快速多频的互动。
  
  **同学：**公司会不会考虑做类似集团“亲听”这样的事情，我们是不是也可以开放，给同学们沉下心来听听客户的声音？\n
  **徐殿勇：**这是很好的，我们的热线电话是有录音软电话，我们要去考虑安排如何让更多同学听到客户真实的声音。
  
  ------------
  
  
   <span style="color: white;background: #1682E6;font-size: 16px;font-weight:bold">第二部分：关于产品规划
  要多贴近看客户，多去交流; 我们要更贴近看客户，多去交流，对真正能复制推广、能更大范围使用的能力有所判断，关起门来自己是想不出来的。</span>
  
  **同学：**BD业绩压力很大，年底法院报预算，但是没有什么很好的产品推给客户。如何让BD更有信心的去推我们的好产品？
  **徐殿勇：**<span style="color: #1682E6"><strong>拳头产品是打出来的</strong></span>，比如我们觉得调解平台不是，但是对新视云来说就是他们的拳头产品，为什么别人可以做出来？销售技能是训练出来的。我们的目标设定会影响打法，打法会影响拳头产品的产生。<span style="color: #1682E6"><strong>过去我们没有系统训练过销售的技能，今天我们要加强BD的销售技能，一定是可以练出来的。</strong></span>
  
  **同学：**公司重点是不是慢慢会从法院产品到了企业业务了，如果这样，我们以前在法院解决方案上的深耕要怎么定位或调整？
  **徐殿勇：**过去政法和企业只有极少数的线连起来了，未来我希望有更多的连接线。注重上下游连接的同时也要深耕自己行业的能力，所以对法院产品自己的需求还是要有的。<span style="color: #1682E6"><strong>我关注的是只看自己，而不关注上下游（的问题）。</strong></span>假如一个客户也没有，我们不做纯粹的研发，因为这样是没法验证客户需求的。
  
  **同学：**视频庭审功能目前可以移植到其他应用上，但是我们目前不能支持为这些移植定制化开发，用户体验不好，我们也做得很累，如果有新的场景，应该怎么做？
  **徐殿勇：**先自己做深，互联网庭审覆盖率还有很大的提升空间。<span style="color: #1682E6"><strong>当我们市场覆盖率做到50%了，做到足够深了，做成了能力了，再考虑做其他行业、场景。</strong></span>当前还不够深，如果不合适就不接这样的需求。
  
  **同学：**从一些项目里抽象底层能力的时候，由于场景很小，打磨的能力出来以后没法在其他场景复用，这个怎么看？
  **徐殿勇：**<span style="color: #1682E6"><strong>我们要更贴近看客户，多去交流，对真正能复制推广、能更大范围使用的能力有所判断，关起门来自己是想不出来的。</strong></span>而且不是简单听一下客户说的就干了，要有过滤和提炼，要去判断出来。最重要的前提要是去收集。
  
  **同学：**有些法院比较喜欢软硬件结合，软硬件结合的事情我们可以考虑做吗？
  **徐殿勇：**我觉得客户有需求就干，我不反对干硬件还是软件，主要是实现客户需求，但是我们不会成为一家卖硬件的公司，如果硬件可以提升我们的软件的体现的能力，为什么不干？
  
  ------------
  
   <span style="color: white;background: #1682E6;font-size: 16px;font-weight:bold">第三部分：关于个人和企业品牌
  我们要有认可自己，成就他人的心态；要多走近客户，多去关心客户真正的需求。</span>
  
  **同学：**中台可能不像前线业务同学有即时的业绩，没有太大的成就感，中台成就感如何提升和价值体现？
  **徐殿勇：**中台的价值要想清楚：<span style="color: #1682E6"><strong>中台是为了避免前线个人低水平重复建设。</strong></span>同时我们要考虑中台职能要延伸，比如销售培训，销售策划，有能力赋能各个区域。<span style="color: #1682E6"><strong>中台要有认可自己，成就他人的心态。</strong></span>做法上要结合业务阶段，刚开始个性化支持力度强一点，到后来要标准化和体系化。中台同学在能力的提升中获得收获，让更多的人依赖你，得到你的帮助。 
  
  **同学：**我是技术同学，大叔你心目中期待的研发团队应该是怎么样的？
  **徐殿勇：**<span style="color: #1682E6"><strong>多走近客户，多去关心客户需求。</strong></span>其实我对我们的技术一点不担心，我看到了大家对前沿技术的追求，也看到了日常不断对研发设计的交流。
   
  **同学：**我们对外的品牌宣传上，可不可以以我们是阿里旗下公司对外宣传？
  **徐殿勇：**客户不会因为我们的宣传而买我们的产品。公司发展到了现在这个阶段，品牌是应该被考虑的了，比如公司在搜索引擎的排名；我们还要把会议营销做起来，比如集团的法律科技大会上我们要主动去做个分会场，把客户都请过来。利用这些方法去挖掘、维护客户。
  
  ------------
  
  #### 【桌长想说】
  第一次圆桌，就有许多同学报名。谢谢大家愿意主动站出来，一起让共道变得更好，为大家的真诚和担当点赞！
  对了，共道圆桌定制饮料杯已同步上线，来收藏呀！
  
  下期「共道圆桌会」等你！
  
  <div style="float:right">和你们围坐在一起的桌长同志</div>`

axios
  .post('https://oapi.dingtalk.com/robot/send?access_token=79d230cc73eeae1eec3e39b7c7ba9d0bbef6cd59bf26c9a248f154fedf4a9424',{
    "msgtype": "markdown",
    "markdown": {
        "title":"消息发送",
        "text": str
    },
})
  .then(res => {
    console.log(`状态码: ${res.statusCode}`)
    console.log(res.data)
  })
  .catch(error => {
    console.error(error)
  })

  